**Load Biometric Dataset**

In [ ]:
import pandas as pd

# Load your data
df = pd.read_csv("/content/api_data_aadhar_biometric_full.csv")

df.head(10)

,date,state,district,pincode,bio_age_5_17,bio_age_17_
0,01-03-2025,Haryana,Mahendragarh,123029,280,577
1,01-03-2025,Bihar,Madhepura,852121,144,369
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091
3,01-03-2025,Bihar,Bhojpur,802158,256,980
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815
5,01-03-2025,Maharashtra,Ratnagiri,416702,155,529
6,01-03-2025,Gujarat,Anand,388130,75,143
7,01-03-2025,Gujarat,Gandhinagar,382421,192,298
8,01-03-2025,Odisha,Dhenkanal,759025,122,214
9,01-03-2025,Gujarat,Valsad,396055,67,85

In [ ]:
df.shape

(1861108, 6)

**State Cleaning**

In [ ]:
# Check unique values
df['state'].unique()

array(['Haryana', 'Bihar', 'Jammu and Kashmir', 'Tamil Nadu',
       'Maharashtra', 'Gujarat', 'Odisha', 'West Bengal', 'Kerala',
       'Rajasthan', 'Punjab', 'Himachal Pradesh', 'Uttar Pradesh',
       'Assam', 'Uttarakhand', 'Madhya Pradesh', 'Karnataka',
       'Andhra Pradesh', 'Telangana', 'Goa', 'Nagaland', 'Jharkhand',
       'Delhi', 'Chhattisgarh', 'Meghalaya', 'Chandigarh', 'Orissa',
       'Puducherry', 'Pondicherry', 'Manipur', 'Sikkim', 'Tripura',
       'Mizoram', 'Arunachal Pradesh', 'Ladakh',
       'Dadra and Nagar Haveli and Daman and Diu', 'Daman and Diu',
       'Andaman and Nicobar Islands', 'Andaman & Nicobar Islands',
       'Dadra and Nagar Haveli', 'Lakshadweep', 'Daman & Diu',
       'Dadra & Nagar Haveli', 'Jammu & Kashmir', 'WESTBENGAL',
       'andhra pradesh', 'Westbengal', 'West  Bengal', 'WEST BENGAL',
       'West Bangal', 'ODISHA', 'odisha', 'West bengal', 'west Bengal',
       'Uttaranchal', 'Chhatisgarh', 'Tamilnadu'], dtype=object)

In [ ]:
df['state_clean'] = (
    df['state']
    .astype(str)
    .str.strip()                    # remove leading/trailing spaces
    .str.lower()                    # lowercase everything
    .str.replace('&', 'and')        # replace & with and
    .str.replace(r'\s+', ' ', regex=True)  # remove extra spaces
)

In [ ]:
state_corrections = {

    # Andhra Pradesh
    "Andhra Pradesh": "Andhra Pradesh",
    "andhra pradesh": "Andhra Pradesh",

    # Arunachal Pradesh
    "Arunachal Pradesh": "Arunachal Pradesh",

    # Assam
    "Assam": "Assam",

    # Bihar
    "Bihar": "Bihar",

    # Chhattisgarh
    "Chhattisgarh": "Chhattisgarh",
    "Chhatisgarh": "Chhattisgarh",

    # Goa
    "Goa": "Goa",

    # Gujarat
    "Gujarat": "Gujarat",

    # Haryana
    "Haryana": "Haryana",

    # Himachal Pradesh
    "Himachal Pradesh": "Himachal Pradesh",

    # Jharkhand
    "Jharkhand": "Jharkhand",

    # Karnataka
    "Karnataka": "Karnataka",

    # Kerala
    "Kerala": "Kerala",

    # Madhya Pradesh
    "Madhya Pradesh": "Madhya Pradesh",

    # Maharashtra
    "Maharashtra": "Maharashtra",

    # Manipur
    "Manipur": "Manipur",

    # Meghalaya
    "Meghalaya": "Meghalaya",

    # Mizoram
    "Mizoram": "Mizoram",

    # Nagaland
    "Nagaland": "Nagaland",

    # Odisha
    "Odisha": "Odisha",
    "Orissa": "Odisha",
    "ODISHA": "Odisha",
    "odisha": "Odisha",

    # Punjab
    "Punjab": "Punjab",

    # Rajasthan
    "Rajasthan": "Rajasthan",

    # Sikkim
    "Sikkim": "Sikkim",

    # Tamil Nadu
    "Tamil Nadu": "Tamil Nadu",
    "Tamilnadu": "Tamil Nadu",

    # Telangana
    "Telangana": "Telangana",

    # Tripura
    "Tripura": "Tripura",

    # Uttar Pradesh
    "Uttar Pradesh": "Uttar Pradesh",

    # Uttarakhand
    "Uttarakhand": "Uttarakhand",
    "Uttaranchal": "Uttarakhand",

    # West Bengal
    "West Bengal": "West Bengal",
    "WESTBENGAL": "West Bengal",
    "Westbengal": "West Bengal",
    "West  Bengal": "West Bengal",
    "WEST BENGAL": "West Bengal",
    "West Bangal": "West Bengal",
    "West bengal": "West Bengal",
    "west Bengal": "West Bengal",

    # --------------------
    # UNION TERRITORIES
    # --------------------

    # Andaman & Nicobar Islands
    "Andaman and Nicobar Islands": "Andaman and Nicobar Islands",
    "Andaman & Nicobar Islands": "Andaman and Nicobar Islands",

    # Chandigarh
    "Chandigarh": "Chandigarh",

    # Dadra & Nagar Haveli and Daman & Diu
    "Dadra and Nagar Haveli and Daman and Diu": "Dadra and Nagar Haveli and Daman and Diu",
    "Dadra and Nagar Haveli": "Dadra and Nagar Haveli and Daman and Diu",
    "Dadra & Nagar Haveli": "Dadra and Nagar Haveli and Daman and Diu",
    "Daman and Diu": "Dadra and Nagar Haveli and Daman and Diu",
    "Daman & Diu": "Dadra and Nagar Haveli and Daman and Diu",

    # Delhi
    "Delhi": "Delhi",

    # Jammu & Kashmir
    "Jammu and Kashmir": "Jammu and Kashmir",
    "Jammu & Kashmir": "Jammu and Kashmir",

    # Ladakh
    "Ladakh": "Ladakh",

    # Lakshadweep
    "Lakshadweep": "Lakshadweep",

    # Puducherry
    "Puducherry": "Puducherry",
    "Pondicherry": "Puducherry"
}

In [ ]:
df['state_clean'] = df['state'].replace(state_corrections)

In [ ]:
df['state_clean'] = df['state_clean'].str.title()

In [ ]:
df['state_clean'].nunique()

36

**Data Understanding**

In [ ]:
df.shape

(1861108, 7)

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu

In [ ]:
df.isnull().sum()

date            0
state           0
district        0
pincode         0
bio_age_5_17    0
bio_age_17_     0
state_clean     0
dtype: int64

**Pincode - Data Cleaning & EDA**

In [ ]:
df['pincode'].head()

0    123029
1    852121
2    185101
3    802158
4    625514
Name: pincode, dtype: int64

In [ ]:
df['pincode'].dtype

dtype('int64')

In [ ]:
df['pincode'] = df['pincode'].astype(str).str.strip()

In [ ]:
df = df[df['pincode'].str.match(r'^\d+$')]

In [ ]:
df = df[df['pincode'].str.len() == 6]

In [ ]:
# Unique pincodes count
df['pincode'].nunique()

19707

In [ ]:
# Check min & max (sanity check)
df['pincode'].astype(int).describe()

count    1.861108e+06
mean     5.217612e+05
std      1.981627e+05
min      1.100010e+05
25%      3.911750e+05
50%      5.224010e+05
75%      6.866362e+05
max      8.554560e+05
Name: pincode, dtype: float64

In [ ]:
df.shape

(1861108, 7)

In [ ]:
df['pincode'] = df['pincode'].astype(str)

**Add New Column pincode_first_digit for Deriving Zone Column**

In [ ]:
df['pincode_first_digit'] = df['pincode'].str[0]

In [ ]:
df['pincode_first_digit'].unique()

array(['1', '8', '6', '4', '3', '7', '2', '5'], dtype=object)

In [ ]:
df['pincode'].astype(str).str.len().value_counts()

pincode
6    1861108
Name: count, dtype: int64

In [ ]:
df['pincode'].astype(str).str[0].value_counts().sort_index()

pincode
1    136619
2    177754
3    170580
4    258612
5    396076
6    288343
7    313104
8    120020
Name: count, dtype: int64

In [ ]:
df['pincode'].value_counts().head(10)

pincode
500055    474
500018    436
500087    406
500090    377
450661    359
605106    358
500067    353
509340    353
533464    353
506006    345
Name: count, dtype: int64

In [ ]:
df[df['pincode'].astype(str).str.match(r'^0{6}$')]

Empty DataFrame
Columns: [date, state, district, pincode, bio_age_5_17, bio_age_17_, state_clean, pincode_first_digit]
Index: []

**Total Pincode Per State**

In [ ]:
df.groupby('state_clean')['pincode'].nunique().sort_values(ascending=False)

state_clean
Tamil Nadu                                  2088
Andhra Pradesh                              1847
Uttar Pradesh                               1753
Maharashtra                                 1607
Kerala                                      1418
West Bengal                                 1354
Karnataka                                   1353
Gujarat                                     1026
Rajasthan                                    986
Odisha                                       940
Bihar                                        917
Madhya Pradesh                               797
Telangana                                    653
Assam                                        574
Punjab                                       526
Himachal Pradesh                             448
Jharkhand                                    364
Haryana                                      305
Uttarakhand                                  297
Chhattisgarh                                 269
Jammu And Kashmir                            206
Delhi                                         94
Goa                                           89
Tripura                                       86
Meghalaya                                     66
Manipur                                       55
Arunachal Pradesh                             54
Mizoram                                       49
Nagaland                                      44
Puducherry                                    38
Chandigarh                                    27
Andaman And Nicobar Islands                   22
Sikkim                                        22
Ladakh                                        14
Dadra And Nagar Haveli And Daman And Diu      10
Lakshadweep                                    9
Name: pincode, dtype: int64

In [ ]:
df.duplicated(subset=['pincode']).sum()

np.int64(1841401)

In [ ]:
df['pincode'].astype(int).describe()

count    1.861108e+06
mean     5.217612e+05
std      1.981627e+05
min      1.100010e+05
25%      3.911750e+05
50%      5.224010e+05
75%      6.866362e+05
max      8.554560e+05
Name: pincode, dtype: float64

In [ ]:
df.shape

(1861108, 8)

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean,pincode_first_digit
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana,1
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar,8
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir,1
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar,8
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu,6

**Added Zone Column From Pincode Column**

In [ ]:
df['zone'] = 'Unknown'

df.loc[df['pincode_first_digit'].isin(['1', '2']), 'zone'] = 'North'
df.loc[df['pincode_first_digit'].isin(['3', '4']), 'zone'] = 'West'
df.loc[df['pincode_first_digit'].isin(['5', '6']), 'zone'] = 'South'
df.loc[df['pincode_first_digit'].isin(['7', '8']), 'zone'] = 'East'
df.loc[df['pincode_first_digit'] == '9', 'zone'] = 'Other'

In [ ]:
df[['pincode_first_digit', 'zone']].value_counts().head(10)

pincode_first_digit  zone
5                    South    396076
7                    East     313104
6                    South    288343
4                    West     258612
2                    North    177754
3                    West     170580
1                    North    136619
8                    East     120020
Name: count, dtype: int64

**Zonewise count of Biometric data**

In [ ]:
df['zone'].value_counts()

zone
South    684419
East     433124
West     429192
North    314373
Name: count, dtype: int64

In [ ]:
df.shape

(1861108, 9)

**Applied Data Cleaning & EDA on Date Column**

In [ ]:
df['date'].isnull().sum()

np.int64(0)

In [ ]:
df['date_dt'] = pd.to_datetime(
    df['date'],
    dayfirst=True,
    errors='coerce'
)

In [ ]:
df['date_dt'].isnull().sum()

np.int64(0)

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean,pincode_first_digit,zone,date_dt
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana,1,North,2025-03-01
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar,8,East,2025-03-01
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir,1,North,2025-03-01
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar,8,East,2025-03-01
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu,6,South,2025-03-01

**For Further Analysis Derived Year, Month, Month Name, Day Name, Week from Date Column**

In [ ]:
df['year'] = df['date_dt'].dt.year

In [ ]:
df['year'].value_counts().sort_index()

year
2025    1861108
Name: count, dtype: int64

In [ ]:
df['month'] = df['date_dt'].dt.month
df['month_name'] = df['date_dt'].dt.month_name()
df['day_name'] = df['date_dt'].dt.day_name()
df['week'] = df['date_dt'].dt.isocalendar().week

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean,pincode_first_digit,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana,1,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar,8,East,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir,1,North,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar,8,East,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu,6,South,2025-03-01,2025,3,March,Saturday,9

**Month-wise Count of Biometric Data**

In [ ]:
month_order = [
    'January','February','March','April','May','June',
    'July','August','September','October','November','December'
]

month_counts = (
    df['month_name']
    .value_counts()
    .reindex(month_order, fill_value=0)
)

month_counts

month_name
January           0
February          0
March         21953
April         21603
May           21987
June          21991
July          22169
August            0
September    416846
October      331715
November     459086
December     543758
Name: count, dtype: int64

**Day-wise Count of Biometric Data**

In [ ]:
df['day_name'].value_counts().reindex([
    'Monday','Tuesday','Wednesday','Thursday',
    'Friday','Saturday','Sunday'
])

day_name
Monday       265809
Tuesday      313583
Wednesday    232185
Thursday     276973
Friday       273221
Saturday     296437
Sunday       202900
Name: count, dtype: int64

In [ ]:
df.groupby(df['date_dt'].dt.to_period('M')).size()

date_dt
2025-03     21953
2025-04     21603
2025-05     21987
2025-06     21991
2025-07     22169
2025-09    416846
2025-10    331715
2025-11    459086
2025-12    543758
Freq: M, dtype: int64

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean,pincode_first_digit,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana,1,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar,8,East,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir,1,North,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar,8,East,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu,6,South,2025-03-01,2025,3,March,Saturday,9

**Dropped pincode_first_digit Column**

In [ ]:
df = df.drop(columns=['pincode_first_digit'])

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar,East,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir,North,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar,East,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu,South,2025-03-01,2025,3,March,Saturday,9

**Apply Data Cleaning & EDA on District Column**

In [ ]:
df['district'].dtype

dtype('O')

In [ ]:
df['district_clean'] = df['district']

In [ ]:
df.head()

,date,state,district,pincode,bio_age_5_17,bio_age_17_,state_clean,zone,date_dt,year,month,month_name,day_name,week,district_clean
0,01-03-2025,Haryana,Mahendragarh,123029,280,577,Haryana,North,2025-03-01,2025,3,March,Saturday,9,Mahendragarh
1,01-03-2025,Bihar,Madhepura,852121,144,369,Bihar,East,2025-03-01,2025,3,March,Saturday,9,Madhepura
2,01-03-2025,Jammu and Kashmir,Punch,185101,643,1091,Jammu And Kashmir,North,2025-03-01,2025,3,March,Saturday,9,Punch
3,01-03-2025,Bihar,Bhojpur,802158,256,980,Bihar,East,2025-03-01,2025,3,March,Saturday,9,Bhojpur
4,01-03-2025,Tamil Nadu,Madurai,625514,271,815,Tamil Nadu,South,2025-03-01,2025,3,March,Saturday,9,Madurai

In [ ]:
df['district_clean'].isnull().sum()

np.int64(0)

In [ ]:
df['district_clean'].head()

0    Mahendragarh
1       Madhepura
2           Punch
3         Bhojpur
4         Madurai
Name: district_clean, dtype: object

In [ ]:
df['district'].nunique()

974

In [ ]:
df['district_clean'].value_counts().head(10)

district_clean
Pune                 11586
Thrissur             11165
East Godavari        10647
North 24 Parganas    10595
Barddhaman           10545
Warangal              9976
Palakkad              9605
Karimnagar            9514
Hyderabad             9422
Ernakulam             9113
Name: count, dtype: int64

In [ ]:
df['district_clean'].value_counts().describe()

count      974.000000
mean      1910.788501
std       2052.013714
min          1.000000
25%        431.250000
50%       1331.000000
75%       2489.750000
max      11586.000000
Name: count, dtype: float64

**Dropped State Column And Rename state_clean As State**

In [ ]:
df = df.drop(columns=['state'])
df.rename(columns={'state_clean': 'state'}, inplace=True)

In [ ]:
df['state_correct'] = df['state']

In [ ]:
df.head()

,date,district,pincode,bio_age_5_17,bio_age_17_,state,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
0,01-03-2025,Mahendragarh,123029,280,577,Haryana,North,2025-03-01,2025,3,March,Saturday,9,Mahendragarh,Haryana
1,01-03-2025,Madhepura,852121,144,369,Bihar,East,2025-03-01,2025,3,March,Saturday,9,Madhepura,Bihar
2,01-03-2025,Punch,185101,643,1091,Jammu And Kashmir,North,2025-03-01,2025,3,March,Saturday,9,Punch,Jammu And Kashmir
3,01-03-2025,Bhojpur,802158,256,980,Bihar,East,2025-03-01,2025,3,March,Saturday,9,Bhojpur,Bihar
4,01-03-2025,Madurai,625514,271,815,Tamil Nadu,South,2025-03-01,2025,3,March,Saturday,9,Madurai,Tamil Nadu

**Now State-wise cleaning for each district**

In [ ]:
df['state'].unique()

array(['Haryana', 'Bihar', 'Jammu And Kashmir', 'Tamil Nadu',
       'Maharashtra', 'Gujarat', 'Odisha', 'West Bengal', 'Kerala',
       'Rajasthan', 'Punjab', 'Himachal Pradesh', 'Uttar Pradesh',
       'Assam', 'Uttarakhand', 'Madhya Pradesh', 'Karnataka',
       'Andhra Pradesh', 'Telangana', 'Goa', 'Nagaland', 'Jharkhand',
       'Delhi', 'Chhattisgarh', 'Meghalaya', 'Chandigarh', 'Puducherry',
       'Manipur', 'Sikkim', 'Tripura', 'Mizoram', 'Arunachal Pradesh',
       'Ladakh', 'Dadra And Nagar Haveli And Daman And Diu',
       'Andaman And Nicobar Islands', 'Lakshadweep'], dtype=object)

**Example of District Cleaning for West Bengal State**

In [ ]:
df_L = df[df['state'] == 'West Bengal']
df_L.head()

,date,district,pincode,bio_age_5_17,bio_age_17_,state,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
11,01-03-2025,Hooghly,712414,91,97,West Bengal,East,2025-03-01,2025,3,March,Saturday,9,Hooghly,West Bengal
12,01-03-2025,Paschim Medinipur,721147,86,116,West Bengal,East,2025-03-01,2025,3,March,Saturday,9,Paschim Medinipur,West Bengal
52,01-03-2025,Purba Medinipur,721441,49,53,West Bengal,East,2025-03-01,2025,3,March,Saturday,9,Purba Medinipur,West Bengal
67,01-03-2025,Birbhum,731244,46,52,West Bengal,East,2025-03-01,2025,3,March,Saturday,9,Birbhum,West Bengal
74,01-03-2025,North 24 Parganas,743145,127,234,West Bengal,East,2025-03-01,2025,3,March,Saturday,9,North 24 Parganas,West Bengal

In [ ]:
df_L.shape

(2400, 15)

In [ ]:
df_L['district_clean'] = df_L['district']
df_L['district_clean'].unique()

/tmp/ipython-input-1478444784.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_L['district_clean'] = df_L['district']

array(['Hooghly', 'Paschim Medinipur', 'Purba Medinipur', 'Birbhum',
       'North 24 Parganas', 'Bankura', 'Barddhaman', 'Maldah',
       'Jalpaiguri', 'Uttar Dinajpur', 'South 24 Parganas', 'Howrah',
       'Murshidabad', 'Cooch Behar', 'Nadia', 'Darjeeling', 'Malda',
       'Kolkata', 'Purulia', 'Paschim Bardhaman', 'Dakshin Dinajpur',
       'North Twenty Four Parganas', 'Bardhaman', 'Koch Bihar',
       'Purba Bardhaman', 'South Dinajpur', 'Puruliya', 'Alipurduar',
       'South Twenty Four Parganas', 'Haora', 'West Midnapore',
       'Darjiling', 'East Midnapore', 'Jhargram', 'Kalimpong',
       'North Dinajpur', 'HOOGHLY', 'Hawrah', 'Hugli', 'South 24 Pargana',
       'Hooghiy', 'Medinipur', 'HOWRAH', 'Burdwan', 'NADIA', 'hooghly',
       'MALDA', 'nadia', 'South DumDum(M)', 'East Midnapur',
       'South 24 parganas', 'East midnapore', 'Bally Jagachha',
       'West Medinipur', 'KOLKATA', 'Domjur', 'South 24 pargana',
       'east midnapore'], dtype=object)

In [ ]:
L_mapping = {
    # Correct districts (already valid)
    'Hooghly': 'Hooghly',
    'Paschim Medinipur': 'Paschim Medinipur',
    'Purba Medinipur': 'Purba Medinipur',
    'Birbhum': 'Birbhum',
    'North Twenty Four Parganas': 'North Twenty Four Parganas',
    'Bankura': 'Bankura',
    'Purba Bardhaman': 'Purba Bardhaman',
    'Malda': 'Malda',
    'Jalpaiguri': 'Jalpaiguri',
    'Uttar Dinajpur': 'Uttar Dinajpur',
    'South Twenty Four Parganas': 'South Twenty Four Parganas',
    'Howrah': 'Howrah',
    'Murshidabad': 'Murshidabad',
    'Cooch Behar': 'Cooch Behar',
    'Nadia': 'Nadia',
    'Darjeeling': 'Darjeeling',
    'Kolkata': 'Kolkata',
    'Purulia': 'Purulia',
    'Paschim Bardhaman': 'Paschim Bardhaman',
    'Dakshin Dinajpur': 'Dakshin Dinajpur',
    'Alipurduar': 'Alipurduar',
    'Jhargram': 'Jhargram',
    'Kalimpong': 'Kalimpong',

    # NOT districts  map to correct district
    'South DumDum(M)': 'North Twenty Four Parganas',
    'Bally Jagachha': 'Howrah',
    'Domjur': 'Howrah'
}

In [ ]:
df_L['district_clean'] = (
    df_L['district_clean']
    .replace(L_mapping)
)

/tmp/ipython-input-1503597074.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_L['district_clean'] = (

In [ ]:
df_L['district_clean'].unique()

array(['Hooghly', 'Paschim Medinipur', 'Purba Medinipur', 'Birbhum',
       'North Twenty Four Parganas', 'Bankura', 'Purba Bardhaman',
       'Malda', 'Jalpaiguri', 'Uttar Dinajpur',
       'South Twenty Four Parganas', 'Howrah', 'Murshidabad',
       'Cooch Behar', 'Nadia', 'Darjeeling', 'Kolkata', 'Purulia',
       'Paschim Bardhaman', 'Dakshin Dinajpur', 'Alipurduar', 'Jhargram',
       'Kalimpong', 'South DumDum(M)', 'Bally Jagachha', 'Domjur'],
      dtype=object)

In [ ]:
df_L['district_clean'].nunique()

23

In [ ]:
df.shape

(1861108, 15)

**Now Added Cleaned District back to Main Table**

In [ ]:
mask = df['state'] == 'West Bengal'
df.loc[mask, 'district'] = df_L['district_clean'].values

In [ ]:
df.shape

(1861107, 15)

In [ ]:
df.head()

**Validation of District Count**

In [ ]:
df[df['state'] == 'West Bengal']['district'].nunique()

3

**Move Districts to Orignal State If State - District Mismatch**

In [ ]:
Tamilnadu_districts_raw = [
      'Viluppuram',
      'Cuddalore'
]

In [ ]:
mask = (
    df['district_clean'].isin(Tamilnadu_districts_raw) &
    (df['state'] == 'Puducherry')
)

df.loc[mask, 'state'] = 'Tamil Nadu'

In [ ]:
df = df[df['district'].str.strip() != '?']

In [ ]:
df.head()

,date,district,pincode,bio_age_5_17,bio_age_17_,state,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
0,01-03-2025,Mahendragarh,123029,280,577,Haryana,North,2025-03-01,2025,3,March,Saturday,9,Mahendragarh,Haryana
1,01-03-2025,Madhepura,852121,144,369,Bihar,East,2025-03-01,2025,3,March,Saturday,9,Madhepura,Bihar
2,01-03-2025,Poonch,185101,643,1091,Jammu And Kashmir,North,2025-03-01,2025,3,March,Saturday,9,Punch,Jammu And Kashmir
3,01-03-2025,Bhojpur,802158,256,980,Bihar,East,2025-03-01,2025,3,March,Saturday,9,Bhojpur,Bihar
4,01-03-2025,Madurai,625514,271,815,Tamil Nadu,South,2025-03-01,2025,3,March,Saturday,9,Madurai,Tamil Nadu

In [ ]:
#df['state'].nunique()
df['state_correct'].nunique()

36

In [ ]:
#df['district'].nunique()
df['district_clean'].nunique()

973

**Now Dropped state_correct and district_clean**

In [ ]:
df = df.drop(columns=['state_correct', 'district_clean'])

In [ ]:
df.head()

,date,district,pincode,bio_age_5_17,bio_age_17_,state,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Mahendragarh,123029,280,577,Haryana,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Madhepura,852121,144,369,Bihar,East,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Poonch,185101,643,1091,Jammu And Kashmir,North,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Bhojpur,802158,256,980,Bihar,East,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Madurai,625514,271,815,Tamil Nadu,South,2025-03-01,2025,3,March,Saturday,9

In [ ]:
df.shape

(1861107, 13)

**Data Cleaning & EDA on bio_age_5_17**

In [ ]:
df['bio_age_5_17'].dtype

dtype('int64')

In [ ]:
df['bio_age_5_17'].isnull().sum()

np.int64(0)

In [ ]:
(df['bio_age_5_17'] < 0).sum()

np.int64(0)

In [ ]:
df['bio_age_5_17'].describe()

count    1.861107e+06
mean     1.839059e+01
std      8.370423e+01
min      0.000000e+00
25%      1.000000e+00
50%      3.000000e+00
75%      1.100000e+01
max      8.002000e+03
Name: bio_age_5_17, dtype: float64

In [ ]:
df.groupby('state')['bio_age_5_17'].sum() \
  .sort_values(ascending=False)

state
Uttar Pradesh                               6207105
Maharashtra                                 3512712
Madhya Pradesh                              3200117
Tamil Nadu                                  2227256
Bihar                                       2208141
Andhra Pradesh                              2138948
Rajasthan                                   2066747
Gujarat                                     1460655
Karnataka                                   1244999
Odisha                                      1211389
Telangana                                   1049016
West Bengal                                 1040512
Chhattisgarh                                 884555
Jharkhand                                    876613
Punjab                                       700162
Haryana                                      693667
Kerala                                       647939
Assam                                        596624
Delhi                                        556237
Uttarakhand                                  424441
Jammu And Kashmir                            416851
Himachal Pradesh                             191566
Manipur                                      166465
Tripura                                      147535
Mizoram                                       85531
Chandigarh                                    49166
Arunachal Pradesh                             42894
Meghalaya                                     36531
Goa                                           34244
Nagaland                                      32561
Puducherry                                    27043
Dadra And Nagar Haveli And Daman And Diu      16362
Sikkim                                        11932
Andaman And Nicobar Islands                   11806
Ladakh                                         6307
Lakshadweep                                    2226
Name: bio_age_5_17, dtype: int64

In [ ]:
df.groupby('district')['bio_age_5_17'].sum() \
  .sort_values(ascending=False).head(15)

district
Pune               283480
Kurnool            242992
Nashik             213100
East Godavari      204904
Thane              202896
Sitapur            200310
Bengaluru Urban    195876
Visakhapatnam      195385
Anantapur          190449
Prayagraj          188523
Guntur             187665
Chittoor           168727
Ahmedabad          166849
Bareilly           166397
Ahilyanagar        165848
Name: bio_age_5_17, dtype: int64

In [ ]:
(df['bio_age_5_17'] == 0).sum()

np.int64(287669)

In [ ]:
df['bio_age_5_17'].min()

0

In [ ]:
df['bio_age_5_17'].max()

8002

**Data Cleaning & EDA on bio_age_17_**

In [ ]:
df['bio_age_17_'].dtype

dtype('int64')

In [ ]:
df['bio_age_17_'].isnull().sum()

np.int64(0)

In [ ]:
(df['bio_age_17_'] < 0).sum()

np.int64(0)

In [ ]:
df['bio_age_17_'].describe()

count    1.861107e+06
mean     1.909414e+01
std      8.806504e+01
min      0.000000e+00
25%      1.000000e+00
50%      4.000000e+00
75%      1.000000e+01
max      7.625000e+03
Name: bio_age_17_, dtype: float64

In [ ]:
df.groupby('district')['bio_age_17_'].sum() \
  .sort_values(ascending=False).head(15)

district
Thane                        368377
Nashik                       363506
Pune                         322282
Mumbai                       303938
Bengaluru Urban              300324
Jalgaon                      268531
Ahmedabad                    254323
Nagpur                       238072
Amravati                     234714
Yavatmal                     234587
Nanded                       217810
Chhatrapati Sambhajinagar    206866
Ahilyanagar                  203569
Jaipur                       197591
North West Delhi             191718
Name: bio_age_17_, dtype: int64

In [ ]:
df.groupby('state')['bio_age_17_'].sum() \
  .sort_values(ascending=False)

state
Maharashtra                                 5713427
Uttar Pradesh                               3370630
Madhya Pradesh                              2723654
Bihar                                       2689446
Tamil Nadu                                  2470876
Rajasthan                                   1928208
Chhattisgarh                                1764179
Gujarat                                     1735859
West Bengal                                 1484107
Karnataka                                   1390955
Odisha                                      1253571
Andhra Pradesh                              1155803
Jharkhand                                   1149684
Telangana                                   1108520
Punjab                                      1039529
Kerala                                       961791
Haryana                                      941787
Delhi                                        748125
Assam                                        386098
Jammu And Kashmir                            369297
Uttarakhand                                  340324
Himachal Pradesh                             204668
Tripura                                      144620
Manipur                                      116122
Nagaland                                      77032
Meghalaya                                     51095
Puducherry                                    42851
Mizoram                                       34798
Goa                                           34153
Arunachal Pradesh                             29500
Chandigarh                                    25296
Dadra And Nagar Haveli And Daman And Diu      22906
Sikkim                                        10888
Andaman And Nicobar Islands                    8892
Ladakh                                         4954
Lakshadweep                                    2594
Name: bio_age_17_, dtype: int64

In [ ]:
df['bio_age_17_'].min()

0

In [ ]:
df['bio_age_17_'].max()

7625

**Now Re-order Columns For Easy Understanding**

In [ ]:
df = df[
    [
        'date',
        'date_dt',
        'year',
        'week',
        'month',
        'month_name',
        'day_name',
        'state',
        'district',
        'pincode',
        'zone',
        'bio_age_5_17',
        'bio_age_17_'
    ]
]

In [ ]:
df.head()

,date,date_dt,year,week,month,month_name,day_name,state,district,pincode,zone,bio_age_5_17,bio_age_17_
0,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Haryana,Mahendragarh,123029,North,280,577
1,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Bihar,Madhepura,852121,East,144,369
2,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Jammu And Kashmir,Poonch,185101,North,643,1091
3,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Bihar,Bhojpur,802158,East,256,980
4,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Tamil Nadu,Madurai,625514,South,271,815

In [ ]:
df.shape

(1861107, 13)

**Check for Rows Where bio_age_5_17 and bio_age_17_ is 0 as that and remove that rows as that is not requied for Data Analysis**

In [ ]:
filtered_df = df[
    (df['bio_age_5_17'] == 0) &
    (df['bio_age_17_'] == 0)
]

In [ ]:
len(filtered_df)

12

In [ ]:
before = len(df)

df = df[~(
    (df['bio_age_5_17'] == 0) &
    (df['bio_age_17_'] == 0)
)]

print("Rows removed:", before - len(df))

Rows removed: 12

In [ ]:
df.shape

(1861095, 13)

In [ ]:
df.head()

,date,date_dt,year,week,month,month_name,day_name,state,district,pincode,zone,bio_age_5_17,bio_age_17_
0,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Haryana,Mahendragarh,123029,North,280,577
1,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Bihar,Madhepura,852121,East,144,369
2,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Jammu And Kashmir,Poonch,185101,North,643,1091
3,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Bihar,Bhojpur,802158,East,256,980
4,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Tamil Nadu,Madurai,625514,South,271,815

**Convert bio_age_5_17 to minor_services and bio_age_17_ to Adult_services for Uniform Name across all datasets**

In [ ]:
df['minor_services'] = df['bio_age_5_17']
df['adult_services'] = df['bio_age_17_']

**Added column Total Activity for Total Updates from minor and Adult Service**

In [ ]:
df['total_activity'] = df['minor_services'] + df['adult_services']

**Now Added Updated Data back to Biometric Dataset**

In [ ]:
df.to_csv(
    "/content/api_data_aadhar_biometric_v1_cleaned.csv",
    index=False
)